xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_ll_comp.h
/** @defgroup COMP_LL_EC_COMMON_WINDOWMODE Comparator common modes - Window mode
  * @{
  */
#define LL_COMP_WINDOWMODE_DISABLE                 (0x00000000U)                                                    /*!< Window mode disable: Comparators 1 and 2 are independent */
#define LL_COMP_WINDOWMODE_COMP1_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | LL_COMP_WINDOWMODE_COMP_EVEN_REGOFFSET_MASK)  /*!< Window mode enable: if used from COMP1 or COMP2 instance, comparators instances pair COMP1 and COMP2 have their input plus connected together, the common input is COMP1 input plus (COMP2 input plus is no more accessible). */
#define LL_COMP_WINDOWMODE_COMP2_INPUT_PLUS_COMMON (COMP_CSR_WINMODE | LL_COMP_WINDOWMODE_COMP_ODD_REGOFFSET_MASK)  /*!< Window mode enable: if used from COMP1 or COMP2 instance, comparators instances pair COMP1 and COMP2 have their input plus connected together, the common input is COMP2 input plus (COMP1 input plus is no more accessible). */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_PLUS Comparator inputs - Input plus (input non-inverting) selection
  * @{
  */
#define LL_COMP_INPUT_PLUS_IO0  (0x00000000U)                           /*!< Comparator input plus connected to IO0(OPA_VOUT for COMP1, DAC_VOUT for COMP2) */
#define LL_COMP_INPUT_PLUS_IO1  (COMP_CSR_INPSEL_0)                     /*!< Comparator input plus connected to IO1(DAC_VOUT for COMP1, OPA_VOUT for COMP2) */
#define LL_COMP_INPUT_PLUS_IO2  (COMP_CSR_INPSEL_1)                     /*!< Comparator input plus connected to IO2(pin PC15 for COMP1, pin PB14 for COMP2) */
#define LL_COMP_INPUT_PLUS_IO3  (COMP_CSR_INPSEL_1 | COMP_CSR_INPSEL_0) /*!< Comparator input plus connected to IO3(pin PD0  for COMP1, pin PC3  for COMP2) */
#define LL_COMP_INPUT_PLUS_IO4  (COMP_CSR_INPSEL_2)                     /*!< Comparator input plus connected to IO4(pin PD1  for COMP1, pin PC4  for COMP2) */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_MINUS Comparator inputs - Input minus (input inverting) selection
  * @{
  */
#define LL_COMP_INPUT_MINUS_IO0 (0x00000000U)                                               /*!< Comparator input minus connected to IO0(pin PC5 for COMP1,  pin PA13 for COMP2) */
#define LL_COMP_INPUT_MINUS_IO1 (COMP_CSR_INMSEL_0)                                         /*!< Comparator input minus connected to IO1(pin PA1 for COMP1,  pin PB15 for COMP2) */
#define LL_COMP_INPUT_MINUS_IO2 (COMP_CSR_INMSEL_1)                                         /*!< Comparator input minus connected to IO2(DAC_VOUT for COMP1, DAC_VOUT for COMP2) */ 
#define LL_COMP_INPUT_MINUS_IO3 (COMP_CSR_INMSEL_1 | COMP_CSR_INMSEL_0)                     /*!< Comparator input minus connected to IO3(VREFCMP for COMP1,  VREFCMP  for COMP2) */
#define LL_COMP_INPUT_MINUS_IO4 (COMP_CSR_INMSEL_2)                                         /*!< Comparator input minus connected to IO4(TS_VIN  for COMP1,  TS_VIN  COMP2) */
#define LL_COMP_INPUT_MINUS_IO5 (COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_0)                     /*!< Comparator input minus connected to IO5(VREFINT for COMP1,  VREFINT COMP2) */
#define LL_COMP_INPUT_MINUS_IO6 (COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1)                     /*!< Comparator input minus connected to IO6(VREFBUF for COMP1,  VREFBUF COMP2) */
#define LL_COMP_INPUT_MINUS_IO7 (COMP_CSR_INMSEL_2 | COMP_CSR_INMSEL_1 | COMP_CSR_INMSEL_0) /*!< Comparator input minus connected to IO7(pin PA13 for COMP1, pin PC0 COMP2) */
/**
  * @}
  */

/** @defgroup COMP_LL_INTERNAL_DIGITAL_OUTPUT Comparator Internal digital output control
  * @{
  */
#define LL_COMP_INTERNAL_OUTPUT_NOFILTER        (0x00000000U)
#define LL_COMP_INTERNAL_OUTPUT_FILTER          (COMP_CSR_INT_OUT_SEL)
/**
  * @}
  */   

/** @defgroup COMP_LL_EC_OUTPUT_POLARITY Comparator output - Output polarity
  * @{
  */
#define LL_COMP_OUTPUTPOL_NONINVERTED       (0x00000000U)           /*!< COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input */
#define LL_COMP_OUTPUTPOL_INVERTED          (COMP_CSR_POLARITY)     /*!< COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input */
/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_BLANKING_SOURCE Comparator output - Blanking source
  * @{
  */
#define LL_COMP_BLANKINGSRC_NONE      (0x00000000UL)                                                      /*!<Comparator output without blanking */
#define LL_COMP_BLANKINGSRC_TIM1_OC4  (                                            COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM1 OC4  (Common to all COMP instances). Note: For COMPx instance availability, please refer to datasheet */
#define LL_COMP_BLANKINGSRC_TIM2_OC3  (                      COMP_CSR_BLANKSEL_1                      )   /*!< Comparator output blanking source TIM2 OC3  (Common to all COMP instances). Note: For COMPx instance availability, please refer to datasheet */
#define LL_COMP_BLANKINGSRC_TIM3_OC3  (                      COMP_CSR_BLANKSEL_1 | COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source TIM3 OC3  (Common to all COMP instances). Note: For COMPx instance availability, please refer to datasheet */
#define LL_COMP_BLANKINGSRC_TIM15_OC2 (COMP_CSR_BLANKSEL_2                                            )   /*!< Comparator output blanking source TIM15 OC2 (Common to all COMP instances). Note: For COMPx instance availability, please refer to datasheet */
#define LL_COMP_BLANKINGSRC_PWM_OC3   (COMP_CSR_BLANKSEL_2 |                       COMP_CSR_BLANKSEL_0)   /*!< Comparator output blanking source PWM OC3   (Common to all COMP instances). Note: For PWM instance availability, please refer to datasheet   */

/**
  * @}
  */

/** @defgroup COMP_LL_EC_OUTPUT_LEVEL Comparator output - Output level
  * @{
  */
#define LL_COMP_OUTPUT_LEVEL_LOW            (0x00000000U)          /*!< Comparator output level low  (if the polarity is not inverted, otherwise to be complemented) */
#define LL_COMP_OUTPUT_LEVEL_HIGH           (0x00000001U)          /*!< Comparator output level high (if the polarity is not inverted, otherwise to be complemented) */

/**
  * @}
  */

/** @defgroup COMP_LL_EC_INPUT_HYSTERESIS Comparator Hysteresis
  * @{
  */
#define LL_COMP_HYSTERESIS_ENABLE           (COMP_CSR_HYST)        /*!< Comparator Hysteresis Enable */
#define LL_COMP_HYSTERESIS_DISABLE          (0x00000000U)          /*!< Comparator Hysteresis Disable */
/**
  * @}
  */

