xuewenxin1/SKD26502_SMART_GREENHOUSE/03.software/02.source_code/01.controller_unit.old/system/libs/fwlib/py32l090_ll_comp.h
/** @defgroup COMP_LL_EC_POWERMODE Comparator modes - Power mode
  * @{
  */
#define LL_COMP_POWERMODE_HIGHSPEED         ((uint32_t)0x00000000U) /*!< COMP power mode to high speed */
#define LL_COMP_POWERMODE_MEDIUMSPEED       (COMP_CSR_PWRMODE)      /*!< COMP power mode to medium speed */

/**
  * @}
  */

/** @defgroup COMP_LL_EC_VREFCMP_DIV Comparator Vrefcmp Div
  * @{
  */
#define LL_COMP_VREFCMP_DIV_1_64VREFCMP     (0x00000000U)     
#define LL_COMP_VREFCMP_DIV_2_64VREFCMP     (                                                                                                    COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_3_64VREFCMP     (                                                                                COMP_CCSR_VCDIV_1                    )
#define LL_COMP_VREFCMP_DIV_4_64VREFCMP     (                                                                                COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_5_64VREFCMP     (                                                            COMP_CCSR_VCDIV_2                                        ) 
#define LL_COMP_VREFCMP_DIV_6_64VREFCMP     (                                                            COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_7_64VREFCMP     (                                                            COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    ) 
#define LL_COMP_VREFCMP_DIV_8_64VREFCMP     (                                                            COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_9_64VREFCMP     (                                        COMP_CCSR_VCDIV_3                                                            )
#define LL_COMP_VREFCMP_DIV_10_64VREFCMP    (                                        COMP_CCSR_VCDIV_3                                         | COMP_CCSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_11_64VREFCMP    (                                        COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1                    )  
#define LL_COMP_VREFCMP_DIV_12_64VREFCMP    (                                        COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_13_64VREFCMP    (                                        COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                                        ) 
#define LL_COMP_VREFCMP_DIV_14_64VREFCMP    (                                        COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_15_64VREFCMP    (                                        COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    ) 
#define LL_COMP_VREFCMP_DIV_16_64VREFCMP    (                                        COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)      
#define LL_COMP_VREFCMP_DIV_17_64VREFCMP    (                    COMP_CCSR_VCDIV_4                                                                                ) 
#define LL_COMP_VREFCMP_DIV_18_64VREFCMP    (                    COMP_CCSR_VCDIV_4                                                             | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_19_64VREFCMP    (                    COMP_CCSR_VCDIV_4                                         | COMP_CCSR_VCDIV_1                    ) 
#define LL_COMP_VREFCMP_DIV_20_64VREFCMP    (                    COMP_CCSR_VCDIV_4                                         | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_21_64VREFCMP    (                    COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2                                        ) 
#define LL_COMP_VREFCMP_DIV_22_64VREFCMP    (                    COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_23_64VREFCMP    (                    COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    )
#define LL_COMP_VREFCMP_DIV_24_64VREFCMP    (                    COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_25_64VREFCMP    (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                                                            ) 
#define LL_COMP_VREFCMP_DIV_26_64VREFCMP    (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                                         | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_27_64VREFCMP    (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1                    ) 
#define LL_COMP_VREFCMP_DIV_28_64VREFCMP    (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_29_64VREFCMP    (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                                        )  
#define LL_COMP_VREFCMP_DIV_30_64VREFCMP    (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)   
#define LL_COMP_VREFCMP_DIV_31_64VREFCMP    (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    )      
#define LL_COMP_VREFCMP_DIV_32_64VREFCMP    (                    COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_33_64VREFCMP    (COMP_CCSR_VCDIV_5                                                                                                    ) 
#define LL_COMP_VREFCMP_DIV_34_64VREFCMP    (COMP_CCSR_VCDIV_5                                                                                 | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_35_64VREFCMP    (COMP_CCSR_VCDIV_5                                                             | COMP_CCSR_VCDIV_1                    )  
#define LL_COMP_VREFCMP_DIV_36_64VREFCMP    (COMP_CCSR_VCDIV_5                                                             | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_37_64VREFCMP    (COMP_CCSR_VCDIV_5                                         | COMP_CCSR_VCDIV_2                                        ) 
#define LL_COMP_VREFCMP_DIV_38_64VREFCMP    (COMP_CCSR_VCDIV_5                                         | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_39_64VREFCMP    (COMP_CCSR_VCDIV_5                                         | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    ) 
#define LL_COMP_VREFCMP_DIV_40_64VREFCMP    (COMP_CCSR_VCDIV_5                                         | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_41_64VREFCMP    (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3                                                            )   
#define LL_COMP_VREFCMP_DIV_42_64VREFCMP    (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3                                         | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_43_64VREFCMP    (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1                    ) 
#define LL_COMP_VREFCMP_DIV_44_64VREFCMP    (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_45_64VREFCMP    (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                                        )  
#define LL_COMP_VREFCMP_DIV_46_64VREFCMP    (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_47_64VREFCMP    (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    ) 
#define LL_COMP_VREFCMP_DIV_48_64VREFCMP    (COMP_CCSR_VCDIV_5                     | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_49_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                                                                                )   
#define LL_COMP_VREFCMP_DIV_50_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                                                             | COMP_CCSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_51_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                                         | COMP_CCSR_VCDIV_1                    )     
#define LL_COMP_VREFCMP_DIV_52_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                                         | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_53_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2                                        )  
#define LL_COMP_VREFCMP_DIV_54_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_55_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    ) 
#define LL_COMP_VREFCMP_DIV_56_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4                     | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_57_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                                                            ) 
#define LL_COMP_VREFCMP_DIV_58_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                                         | COMP_CCSR_VCDIV_0)  
#define LL_COMP_VREFCMP_DIV_59_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1                    ) 
#define LL_COMP_VREFCMP_DIV_60_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3                     | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0)   
#define LL_COMP_VREFCMP_DIV_61_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                                        )     
#define LL_COMP_VREFCMP_DIV_62_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2                     | COMP_CCSR_VCDIV_0) 
#define LL_COMP_VREFCMP_DIV_63_64VREFCMP    (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1                    )  
#define LL_COMP_VREFCMP_DIV_VREFCMP         (COMP_CCSR_VCDIV_5 | COMP_CCSR_VCDIV_4 | COMP_CCSR_VCDIV_3 | COMP_CCSR_VCDIV_2 | COMP_CCSR_VCDIV_1 | COMP_CCSR_VCDIV_0) 
/**
  * @}
  */
 
/** @defgroup COMP_LL_EC_VREFCMP_SOURCE Comparator Vrefcmp Source
  * @{
  */  
#define LL_COMP_VREFCMP_SOURCE_VREFBUF      (0x00000000U)
#define LL_COMP_VREFCMP_SOURCE_VCC          (COMP_CCSR_SSEL)
/**
  * @}
  */

/** @defgroup COMP_LL_EC_HW_DELAYS  Definitions of COMP hardware constraints delays
  * @note   Only COMP peripheral HW delays are defined in COMP LL driver driver,
  *         not timeout values.
  *         For details on delays values, refer to descriptions in source code
  *         above each literal definition.
  * @{
  */

